{"keras_version": "2.1.5", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 3, 112, 112]}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_2", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_2", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_3", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_3", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_4", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_4", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_5", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_5", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_6", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_6", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "elu_6", "class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_7", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_7", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "elu_7", "class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_8", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_8", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "elu_8", "class_name": "ELU", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first"}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_9", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_9", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "elu_9", "class_name": "ELU", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_10", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_10", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "elu_10", "class_name": "ELU", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "size": [2, 2], "data_format": "channels_first", "trainable": true}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"mode": "concat", "name": "merge_1", "concat_axis": 1, "output_mask": null, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_8", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_11", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_11", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "elu_11", "class_name": "ELU", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_12", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_12", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "elu_12", "class_name": "ELU", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "size": [2, 2], "data_format": "channels_first", "trainable": true}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"mode": "concat", "name": "merge_2", "concat_axis": 1, "output_mask": null, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_6", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_13", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_13", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "elu_13", "class_name": "ELU", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_14", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_14", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "elu_14", "class_name": "ELU", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "size": [2, 2], "data_format": "channels_first", "trainable": true}, "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"mode": "concat", "name": "merge_3", "concat_axis": 1, "output_mask": null, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw"}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_15", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_15", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "elu_15", "class_name": "ELU", "config": {"name": "elu_15", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_16", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_16", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "elu_16", "class_name": "ELU", "config": {"name": "elu_16", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "size": [2, 2], "data_format": "channels_first", "trainable": true}, "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"mode": "concat", "name": "merge_4", "concat_axis": 1, "output_mask": null, "output_shape": null, "arguments": {}, "output_mask_type": "raw", "dot_axes": -1, "output_shape_type": "raw", "mode_type": "raw"}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_17", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["merge_4", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_17", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "elu_17", "class_name": "ELU", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_18", "padding": "same", "kernel_size": [3, 3], "data_format": "channels_first", "filters": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"name": "cropping2d_1", "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "data_format": "channels_first", "cropping": [[16, 16], [16, 16]]}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "name": "batch_normalization_18", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "axis": 1, "scale": true, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "elu_18", "class_name": "ELU", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_19", "padding": "valid", "kernel_size": [1, 1], "data_format": "channels_first", "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "use_bias": true}, "inbound_nodes": [[["elu_18", 0, 0, {}]]]}], "output_layers": [["conv2d_19", 0, 0]]}, "backend": "tensorflow"}