{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 3, 112, 112], "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "elu_1", "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_1", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "name": "add_1", "class_name": "Add", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "elu_2", "class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_2", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_5", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "elu_3", "class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_3", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_6", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_4", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]], "name": "add_2", "class_name": "Add", "config": {"trainable": true, "name": "add_2"}}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "elu_4", "class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_4", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_8", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "elu_5", "class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_5", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_9", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_7", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["conv2d_7", 0, 0, {}]]], "name": "add_3", "class_name": "Add", "config": {"trainable": true, "name": "add_3"}}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "elu_6", "class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_6", 0, 0, {}]]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_11", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "elu_7", "class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_7", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_12", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_10", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["conv2d_10", 0, 0, {}]]], "name": "add_4", "class_name": "Add", "config": {"trainable": true, "name": "add_4"}}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "elu_8", "class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_8", 0, 0, {}]]], "name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 96, "dilation_rate": [1, 1], "name": "conv2d_14", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "elu_9", "class_name": "ELU", "config": {"name": "elu_9", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_9", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 96, "dilation_rate": [1, 1], "name": "conv2d_15", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 96, "dilation_rate": [1, 1], "name": "conv2d_13", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["conv2d_13", 0, 0, {}]]], "name": "add_5", "class_name": "Add", "config": {"trainable": true, "name": "add_5"}}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "elu_10", "class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_10", 0, 0, {}]]], "name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_8", 0, 0, {"mask": [null, null]}]]], "name": "merge_1", "class_name": "Merge", "config": {"output_shape": null, "arguments": {}, "name": "merge_1", "mode": "concat", "output_shape_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "mode_type": "raw", "output_mask": null, "dot_axes": -1}}, {"inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_17", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "elu_11", "class_name": "ELU", "config": {"name": "elu_11", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_11", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_18", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["merge_1", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 48, "dilation_rate": [1, 1], "name": "conv2d_16", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["conv2d_16", 0, 0, {}]]], "name": "add_6", "class_name": "Add", "config": {"trainable": true, "name": "add_6"}}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "elu_12", "class_name": "ELU", "config": {"name": "elu_12", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_12", 0, 0, {}]]], "name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_6", 0, 0, {"mask": [null, null]}]]], "name": "merge_2", "class_name": "Merge", "config": {"output_shape": null, "arguments": {}, "name": "merge_2", "mode": "concat", "output_shape_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "mode_type": "raw", "output_mask": null, "dot_axes": -1}}, {"inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_20", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "elu_13", "class_name": "ELU", "config": {"name": "elu_13", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_13", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_21", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["merge_2", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_19", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["conv2d_19", 0, 0, {}]]], "name": "add_7", "class_name": "Add", "config": {"trainable": true, "name": "add_7"}}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "elu_14", "class_name": "ELU", "config": {"name": "elu_14", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_14", 0, 0, {}]]], "name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_3", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]], "name": "merge_3", "class_name": "Merge", "config": {"output_shape": null, "arguments": {}, "name": "merge_3", "mode": "concat", "output_shape_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "mode_type": "raw", "output_mask": null, "dot_axes": -1}}, {"inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_23", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_15", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "elu_15", "class_name": "ELU", "config": {"name": "elu_15", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_15", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_24", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_16", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["merge_3", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 12, "dilation_rate": [1, 1], "name": "conv2d_22", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["conv2d_22", 0, 0, {}]]], "name": "add_8", "class_name": "Add", "config": {"trainable": true, "name": "add_8"}}, {"inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "elu_16", "class_name": "ELU", "config": {"name": "elu_16", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_16", 0, 0, {}]]], "name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "size": [2, 2], "data_format": "channels_first"}}, {"inbound_nodes": [[["up_sampling2d_4", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]], "name": "merge_4", "class_name": "Merge", "config": {"output_shape": null, "arguments": {}, "name": "merge_4", "mode": "concat", "output_shape_type": "raw", "output_mask_type": "raw", "concat_axis": 1, "mode_type": "raw", "output_mask": null, "dot_axes": -1}}, {"inbound_nodes": [[["merge_4", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_26", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_17", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "elu_17", "class_name": "ELU", "config": {"name": "elu_17", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_17", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_27", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["merge_4", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "padding": "same", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 6, "dilation_rate": [1, 1], "name": "conv2d_25", "activation": "linear", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_25", 0, 0, {}]]], "name": "add_9", "class_name": "Add", "config": {"trainable": true, "name": "add_9"}}, {"inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "cropping2d_1", "class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "data_format": "channels_first", "cropping": [[16, 16], [16, 16]]}}, {"inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_18", "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "momentum": 0.99, "axis": 1, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "elu_18", "class_name": "ELU", "config": {"name": "elu_18", "trainable": true, "alpha": 1.0}}, {"inbound_nodes": [[["elu_18", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "use_bias": true, "kernel_size": [1, 1], "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "filters": 1, "dilation_rate": [1, 1], "name": "conv2d_28", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "output_layers": [["conv2d_28", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}