{"keras_version": "2.1.5", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["conv2d_22", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 3, 112, 112], "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_2", "config": {"name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_1", "config": {"name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"name": "conv2d_5", "config": {"name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_6", "config": {"name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "add_2", "config": {"name": "add_2", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"name": "conv2d_8", "config": {"name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "config": {"name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_9", "config": {"name": "conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "config": {"name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "conv2d_7", "config": {"name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "add_3", "config": {"name": "add_3", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["conv2d_7", 0, 0, {}]]]}, {"name": "elu_6", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"name": "conv2d_11", "config": {"name": "conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 256, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "config": {"name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "elu_7", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_12", "config": {"name": "conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 256, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "config": {"name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "conv2d_10", "config": {"name": "conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 256, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "add_4", "config": {"name": "add_4", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"name": "elu_8", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "config": {"name": "up_sampling2d_1", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"name": "merge_1", "config": {"name": "merge_1", "mode": "concat", "dot_axes": -1, "output_mask": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "output_shape": null, "concat_axis": 1, "mode_type": "raw"}, "class_name": "Merge", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_6", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_14", "config": {"name": "conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "batch_normalization_9", "config": {"name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "elu_9", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_15", "config": {"name": "conv2d_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "config": {"name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "conv2d_13", "config": {"name": "conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 128, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"name": "add_5", "config": {"name": "add_5", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["conv2d_13", 0, 0, {}]]]}, {"name": "elu_10", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "config": {"name": "up_sampling2d_2", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"name": "merge_2", "config": {"name": "merge_2", "mode": "concat", "dot_axes": -1, "output_mask": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "output_shape": null, "concat_axis": 1, "mode_type": "raw"}, "class_name": "Merge", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_17", "config": {"name": "conv2d_17", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "batch_normalization_11", "config": {"name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "elu_11", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_18", "config": {"name": "conv2d_18", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "config": {"name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "conv2d_16", "config": {"name": "conv2d_16", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 64, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"name": "add_6", "config": {"name": "add_6", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["conv2d_16", 0, 0, {}]]]}, {"name": "elu_12", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "config": {"name": "up_sampling2d_3", "data_format": "channels_first", "trainable": true, "size": [2, 2]}, "class_name": "UpSampling2D", "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"name": "merge_3", "config": {"name": "merge_3", "mode": "concat", "dot_axes": -1, "output_mask": null, "arguments": {}, "output_mask_type": "raw", "output_shape_type": "raw", "output_shape": null, "concat_axis": 1, "mode_type": "raw"}, "class_name": "Merge", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]]}, {"name": "conv2d_20", "config": {"name": "conv2d_20", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"name": "batch_normalization_13", "config": {"name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "elu_13", "config": {"name": "elu_13", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_21", "config": {"name": "conv2d_21", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"name": "conv2d_19", "config": {"name": "conv2d_19", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}}, "dilation_rate": [1, 1], "padding": "same", "use_bias": true, "filters": 32, "activation": "linear", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"name": "add_7", "config": {"name": "add_7", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"name": "cropping2d_1", "config": {"name": "cropping2d_1", "data_format": "channels_first", "trainable": true, "cropping": [[16, 16], [16, 16]]}, "class_name": "Cropping2D", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "batch_normalization_14", "config": {"name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "center": true, "axis": 1, "gamma_regularizer": null, "scale": true, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}, "class_name": "BatchNormalization", "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"name": "elu_14", "config": {"name": "elu_14", "alpha": 1.0, "trainable": true}, "class_name": "ELU", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_22", "config": {"name": "conv2d_22", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_first", "strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "dilation_rate": [1, 1], "padding": "valid", "use_bias": true, "filters": 1, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null}, "class_name": "Conv2D", "inbound_nodes": [[["elu_14", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}