{"backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 3, 112, 112], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "center": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_2"}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "center": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "padding": "valid"}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_3"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "center": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_4"}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "center": true}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_2", "padding": "valid"}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_5"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "center": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_6"}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "center": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_3", "padding": "valid"}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_7"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "center": true}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_8"}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "center": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_1", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_1", "trainable": true}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"concat_axis": 1, "mode": "concat", "arguments": {}, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "name": "merge_1", "output_shape_type": "raw", "output_mask_type": "raw"}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_6", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_9"}, "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "center": true}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"trainable": true, "name": "elu_9", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_10"}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "center": true}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"trainable": true, "name": "elu_10", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_2", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_2", "trainable": true}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "Merge", "name": "merge_2", "config": {"concat_axis": 1, "mode": "concat", "arguments": {}, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "name": "merge_2", "output_shape_type": "raw", "output_mask_type": "raw"}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_11"}, "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "center": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"trainable": true, "name": "elu_11", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_12"}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "center": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"trainable": true, "name": "elu_12", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "name": "up_sampling2d_3", "config": {"size": [2, 2], "data_format": "channels_first", "name": "up_sampling2d_3", "trainable": true}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "Merge", "name": "merge_3", "config": {"concat_axis": 1, "mode": "concat", "arguments": {}, "output_shape": null, "mode_type": "raw", "dot_axes": -1, "output_mask": null, "name": "merge_3", "output_shape_type": "raw", "output_mask_type": "raw"}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "name": "conv2d_13", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_13"}, "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "center": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_13", "config": {"trainable": true, "name": "elu_13", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_14", "config": {"kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "uniform", "seed": null, "scale": 2.0}}, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "same", "name": "conv2d_14"}, "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"class_name": "Cropping2D", "name": "cropping2d_1", "config": {"trainable": true, "data_format": "channels_first", "name": "cropping2d_1", "cropping": [[16, 16], [16, 16]]}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"momentum": 0.99, "scale": true, "gamma_constraint": null, "trainable": true, "axis": 1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "center": true}, "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_14", "config": {"trainable": true, "name": "elu_14", "alpha": 1.0}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_15", "config": {"kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 1, "use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "bias_constraint": null, "data_format": "channels_first", "padding": "valid", "name": "conv2d_15"}, "inbound_nodes": [[["elu_14", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_15", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.5"}