{"keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 3, 112, 112], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_2", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "name": "elu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_3", "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "name": "elu_2", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_1", "padding": "valid"}, "name": "max_pooling2d_1", "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "name": "elu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_6", "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_2"}, "name": "add_2", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "name": "elu_4", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_2", "padding": "valid"}, "name": "max_pooling2d_2", "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_8", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_5", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "name": "elu_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_9", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_9", "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_6", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_3"}, "name": "add_3", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["conv2d_7", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "name": "elu_6", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_3", "padding": "valid"}, "name": "max_pooling2d_3", "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_11", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_11", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_7", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "name": "elu_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_12", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_12", "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_8", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_10", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_10", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_4"}, "name": "add_4", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["conv2d_10", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "name": "elu_8", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_first", "name": "max_pooling2d_4", "padding": "valid"}, "name": "max_pooling2d_4", "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_14", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_14", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_9", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "name": "elu_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_15", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_15", "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_10", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_13", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_13", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_5"}, "name": "add_5", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["conv2d_13", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "name": "elu_10", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_first"}, "name": "up_sampling2d_1", "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"output_shape": null, "concat_axis": 1, "arguments": {}, "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "name": "merge_1", "mode": "concat", "dot_axes": -1}, "name": "merge_1", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_8", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_17", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_17", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_11", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_11"}, "name": "elu_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_18", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_18", "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_12", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_16", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 96, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_16", "inbound_nodes": [[["merge_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_6"}, "name": "add_6", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["conv2d_16", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_12"}, "name": "elu_12", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_first"}, "name": "up_sampling2d_2", "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"output_shape": null, "concat_axis": 1, "arguments": {}, "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "name": "merge_2", "mode": "concat", "dot_axes": -1}, "name": "merge_2", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_6", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_20", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_20", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_13", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_13"}, "name": "elu_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_21", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_21", "inbound_nodes": [[["elu_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_14", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_19", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_19", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_7"}, "name": "add_7", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["conv2d_19", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_14"}, "name": "elu_14", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_3", "data_format": "channels_first"}, "name": "up_sampling2d_3", "inbound_nodes": [[["elu_14", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"output_shape": null, "concat_axis": 1, "arguments": {}, "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "name": "merge_3", "mode": "concat", "dot_axes": -1}, "name": "merge_3", "inbound_nodes": [[["up_sampling2d_3", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_23", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_23", "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_15", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_15"}, "name": "elu_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_24", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_24", "inbound_nodes": [[["elu_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_16", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_22", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 24, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_22", "inbound_nodes": [[["merge_3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_8"}, "name": "add_8", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_16"}, "name": "elu_16", "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_4", "data_format": "channels_first"}, "name": "up_sampling2d_4", "inbound_nodes": [[["elu_16", 0, 0, {}]]]}, {"class_name": "Merge", "config": {"output_shape": null, "concat_axis": 1, "arguments": {}, "output_mask_type": "raw", "mode_type": "raw", "output_shape_type": "raw", "output_mask": null, "name": "merge_4", "mode": "concat", "dot_axes": -1}, "name": "merge_4", "inbound_nodes": [[["up_sampling2d_4", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_26", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_26", "inbound_nodes": [[["merge_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_17", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_17"}, "name": "elu_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_27", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "padding": "same"}, "name": "conv2d_27", "inbound_nodes": [[["elu_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_25", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 2.0, "mode": "fan_in", "seed": null}}, "kernel_constraint": null, "filters": 12, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "same"}, "name": "conv2d_25", "inbound_nodes": [[["merge_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_9"}, "name": "add_9", "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[16, 16], [16, 16]], "data_format": "channels_first", "name": "cropping2d_1"}, "name": "cropping2d_1", "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"axis": 1, "scale": true, "gamma_constraint": null, "trainable": true, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_18", "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_18", "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]]}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_18"}, "name": "elu_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"activation": "sigmoid", "bias_regularizer": null, "kernel_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_28", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 1, "dilation_rate": [1, 1], "data_format": "channels_first", "activity_regularizer": null, "kernel_size": [1, 1], "bias_constraint": null, "padding": "valid"}, "name": "conv2d_28", "inbound_nodes": [[["elu_18", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_28", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}