{"keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, 112, 112], "sparse": false, "name": "input_1", "dtype": "float32"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_1"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "name": "elu_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_2"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "name": "elu_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_2", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first"}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_3"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_3"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "name": "elu_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_4"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_4"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "name": "elu_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["elu_4", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first"}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_5", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_5"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_5"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "name": "elu_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 128, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_6", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_6"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_6"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}, "name": "elu_6"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["elu_6", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_first"}, "name": "up_sampling2d_1"}, {"class_name": "Merge", "inbound_nodes": [[["up_sampling2d_1", 0, 0, {"mask": [null, null]}], ["elu_4", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 1, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "name": "merge_1", "dot_axes": -1, "output_mask_type": "raw", "output_mask": null, "mode_type": "raw", "arguments": {}}, "name": "merge_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["merge_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_7", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_7"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_7"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}, "name": "elu_7"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_7", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 64, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_8", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_8"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_8"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}, "name": "elu_8"}, {"class_name": "UpSampling2D", "inbound_nodes": [[["elu_8", 0, 0, {}]]], "config": {"trainable": true, "size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_first"}, "name": "up_sampling2d_2"}, {"class_name": "Merge", "inbound_nodes": [[["up_sampling2d_2", 0, 0, {"mask": [null, null]}], ["elu_2", 0, 0, {"mask": [null, null]}]]], "config": {"concat_axis": 1, "mode": "concat", "output_shape": null, "output_shape_type": "raw", "name": "merge_2", "dot_axes": -1, "output_mask_type": "raw", "output_mask": null, "mode_type": "raw", "arguments": {}}, "name": "merge_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["merge_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_9", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_9"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_9"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}, "name": "elu_9"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_9", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_10", "kernel_constraint": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_10"}, {"class_name": "Cropping2D", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"trainable": true, "cropping": [[16, 16], [16, 16]], "name": "cropping2d_1", "data_format": "channels_first"}, "name": "cropping2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["cropping2d_1", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "gamma_constraint": null, "scale": true, "momentum": 0.99, "axis": 1, "beta_regularizer": null}, "name": "batch_normalization_10"}, {"class_name": "ELU", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "alpha": 1.0, "name": "elu_10"}, "name": "elu_10"}, {"class_name": "Conv2D", "inbound_nodes": [[["elu_10", 0, 0, {}]]], "config": {"bias_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "filters": 1, "dilation_rate": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "kernel_size": [1, 1], "use_bias": true, "kernel_regularizer": null, "name": "conv2d_11", "kernel_constraint": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_first"}, "name": "conv2d_11"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["conv2d_11", 0, 0]]}}